v2206/urban_Microclimate/02_ABL_pre/0.orig/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 1e-3;

boundaryField
{
    // inlet
    // {
    //     type            fixedValue;
    //     value           $internalField;
    // }

    // outlet
    // {
    //     type            zeroGradient;
    // }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    upperAtm
    {
        type            zeroGradient;
        
    }

    ground
    {
        // type            nutkWallFunction;
        type            nutkRoughWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        Cs              uniform 0.5;
        Ks              uniform 1.45;
        value           $internalField;
    }

    frontAtm
    {
        type            cyclic;
    }

    backAtm
    {
        type            cyclic;
    }
}


// ************************************************************************* //
