v2206/urban_Microclimate/02_ABL_pre/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 0.0007;

boundaryField
{
    // #include            "include/ABLConditions"

    // inlet
    // {
    //     type            atmBoundaryLayerInletOmega;
    //     #include        "include/ABLConditions"
    //     value           uniform 0;
    // }

    // outlet
    // {
    //     type            inletOutlet;
    //     inletValue      $internalField;
    //     value           $internalField;
    // }

    inlet
    {
        type            cyclic;
    }

    outlet
    {
        type            cyclic;
    }

    upperAtm
    {
        type            zeroGradient;
    }

    ground
    {
        type            omegaWallFunction;
        Cmu             $Cmu;
        kappa           $kappa;
        value           $internalField;
    }

    frontAtm
    {
        type            cyclic;
    }

    backAtm
    {
        type            cyclic;
    }


}


// ************************************************************************* //
